apache/nuttx/arch/arm/src/common/stm32/stm32_usbdev_m0_v1.c
      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          uinfo("[repeats %d more times]\n", count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval   = val;
      count    = 1;
    }

  /* Show the register value read */

  uinfo("%08" PRIx32 "->%04x\n", addr, val);
  return val;
}
#endif

/****************************************************************************
 * Name: stm32_putreg
 ****************************************************************************/

#ifdef CONFIG_STM32_USBDEV_REGDEBUG
static void stm32_putreg(uint32_t val, uint32_t addr)
{
  /* Show the register value being written */

  uinfo("%08" PRIx32 "<-%04x\n", addr, val);

  /* Write the value */

#ifdef CONFIG_STM32_HAVE_IP_USBDEV_M0_V2
  putreg32(val, addr);
#else
  putreg16(val, addr);
#endif
}
#endif

/****************************************************************************
 * Name: stm32_dumpep
 ****************************************************************************/

#ifdef CONFIG_STM32_USBDEV_REGDEBUG
static void stm32_dumpep(int epno)
{
  uint32_t addr;

#ifdef CONFIG_STM32_HAVE_IP_USBDEV_M0_V2
  uinfo("CNTR:   %04" PRIx32 "\n", getreg32(STM32_USB_CNTR));
  uinfo("ISTR:   %04" PRIx32 "\n", getreg32(STM32_USB_ISTR));
  uinfo("FNR:    %04" PRIx32 "\n", getreg32(STM32_USB_FNR));
  uinfo("DADDR:  %04" PRIx32 "\n", getreg32(STM32_USB_DADDR));

  addr = STM32_USB_EPR(epno);
  uinfo("EPR%d:   [%08" PRIx32 "] %04" PRIx32 "\n",
        epno, addr, getreg32(addr));

  addr = STM32_USB_BTABLE_ADDR(epno, 0);
  uinfo("DESC:   %08" PRIx32 "\n", addr);

  addr = STM32_USB_TX(epno);
  uinfo("  TX BUF:  [%08" PRIx32 "] %08" PRIx32 "\n",
        addr, getreg32(addr));

  addr = STM32_USB_RX(epno);
  uinfo("  RX BUF:  [%08" PRIx32 "] %08" PRIx32 "\n",
        addr, getreg32(addr));
#else
  /* Common registers */

  uinfo("CNTR:   %04x\n", getreg16(STM32_USB_CNTR));
  uinfo("ISTR:   %04x\n", getreg16(STM32_USB_ISTR));
  uinfo("FNR:    %04x\n", getreg16(STM32_USB_FNR));
  uinfo("DADDR:  %04x\n", getreg16(STM32_USB_DADDR));
  uinfo("BTABLE: %04x\n", getreg16(STM32_USB_BTABLE));

  /* Endpoint register */

  addr = STM32_USB_EPR(epno);
  uinfo("EPR%d:   [%08" PRIx32 "] %04x\n", epno, addr, getreg16(addr));

  /* Endpoint descriptor */

  addr = STM32_USB_BTABLE_ADDR(epno, 0);
  uinfo("DESC:   %08" PRIx32 "\n", addr);

  /* Endpoint buffer descriptor */

  addr = STM32_USB_ADDR_TX(epno);
  uinfo("  TX ADDR:  [%08" PRIx32 "] %04x\n",  addr, getreg16(addr));

  addr = STM32_USB_COUNT_TX(epno);
  uinfo("     COUNT: [%08" PRIx32 "] %04x\n",  addr, getreg16(addr));

  addr = STM32_USB_ADDR_RX(epno);
  uinfo("  RX ADDR:  [%08" PRIx32 "] %04x\n",  addr, getreg16(addr));

  addr = STM32_USB_COUNT_RX(epno);
  uinfo("     COUNT: [%08" PRIx32 "] %04x\n",  addr, getreg16(addr));
#endif
}
#endif

/****************************************************************************
 * Low-Level Helpers
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_seteptxcount
 ****************************************************************************/

static inline void stm32_seteptxcount(uint8_t epno, uint16_t count)
{
#ifdef CONFIG_STM32_HAVE_IP_USBDEV_M0_V2
  volatile uint32_t *epaddr = (uint32_t *)STM32_USB_TX(epno);
  *epaddr = (*epaddr & 0x0000ffff) | ((uint32_t)count << 16);
#else
  volatile uint16_t *epaddr = (uint16_t *)STM32_USB_COUNT_TX(epno);
  *epaddr = count;
#endif
}

/****************************************************************************
 * Name: stm32_seteptxaddr
 ****************************************************************************/

static inline void stm32_seteptxaddr(uint8_t epno, uint16_t addr)
{
#ifdef CONFIG_STM32_HAVE_IP_USBDEV_M0_V2
  volatile uint32_t *txaddr = (uint32_t *)STM32_USB_TX(epno);
  *txaddr = (*txaddr & 0xffff0000) | addr;
#else
  volatile uint16_t *txaddr = (uint16_t *)STM32_USB_ADDR_TX(epno);
  *txaddr = addr;
#endif
}

/****************************************************************************
 * Name: stm32_geteptxaddr
 ****************************************************************************/

static inline uint16_t stm32_geteptxaddr(uint8_t epno)
{
#ifdef CONFIG_STM32_HAVE_IP_USBDEV_M0_V2
  volatile uint32_t *txaddr = (uint32_t *)STM32_USB_TX(epno);
#else
  volatile uint16_t *txaddr = (uint16_t *)STM32_USB_ADDR_TX(epno);
#endif
  return (uint16_t)*txaddr;
}

/****************************************************************************
 * Name: stm32_seteprxcount
 ****************************************************************************/

static void stm32_seteprxcount(uint8_t epno, uint16_t count)
{
#ifdef CONFIG_STM32_HAVE_IP_USBDEV_M0_V2
  volatile uint32_t *epaddr = (uint32_t *)STM32_USB_RX(epno);
#else
  volatile uint16_t *epaddr = (uint16_t *)STM32_USB_COUNT_RX(epno);
#endif
  uint32_t rxcount = 0;
  uint16_t nblocks;

  /* The upper bits of the RX COUNT value contain the size of allocated
   * RX buffer.  This is based on a block size of 2 or 32:
   *
   * USB_COUNT_RX_BL_SIZE not set:
   *   nblocks is in units of 2 bytes.
   *     00000 - not allowed
   *     00001 - 2 bytes
   *     ....
   *     11111 - 62 bytes
   *
   * USB_COUNT_RX_BL_SIZE set:
   *     00000 - 32 bytes
   *     00001 - 64 bytes
   *     ...
   *     01111 - 512 bytes
   *     1xxxx - Not allowed
   */

  if (count > 62)
    {
      /* Blocks of 32 (with 0 meaning one block of 32) */

      nblocks = (count >> 5) - 1 ;
      DEBUGASSERT(nblocks <= 0x0f);
      rxcount = (uint32_t)((nblocks <<
                            USB_COUNT_RX_NUM_BLOCK_SHIFT) |
                            USB_COUNT_RX_BL_SIZE);
    }
  else if (count > 0)
    {
      /* Blocks of 2 (with 1 meaning one block of 2) */

      nblocks = (count + 1) >> 1;
      DEBUGASSERT(nblocks > 0 && nblocks < 0x1f);
      rxcount = (uint32_t)(nblocks << USB_COUNT_RX_NUM_BLOCK_SHIFT);
    }
#ifdef CONFIG_STM32_HAVE_IP_USBDEV_M0_V2
  *epaddr = (*epaddr & 0x0000ffff) | rxcount;
#else
  *epaddr = rxcount;
#endif
}

/****************************************************************************
 * Name: stm32_geteprxcount
 ****************************************************************************/

static inline uint16_t stm32_geteprxcount(uint8_t epno)
{
#ifdef CONFIG_STM32_HAVE_IP_USBDEV_M0_V2
  volatile uint32_t *epaddr = (uint32_t *)STM32_USB_RX(epno);
  return (uint16_t)((*epaddr & USB_COUNT_RX_MASK) >> 16);
#else
  volatile uint16_t *epaddr = (uint16_t *)STM32_USB_COUNT_RX(epno);
  return (*epaddr) & USB_COUNT_RX_MASK;
#endif
}

/****************************************************************************
 * Name: stm32_seteprxaddr
 ****************************************************************************/

static inline void stm32_seteprxaddr(uint8_t epno, uint16_t addr)
{
#ifdef CONFIG_STM32_HAVE_IP_USBDEV_M0_V2
  volatile uint32_t *rxaddr = (uint32_t *)STM32_USB_RX(epno);
  *rxaddr = (*rxaddr & 0xffff0000) | addr;
#else
  volatile uint16_t *rxaddr = (uint16_t *)STM32_USB_ADDR_RX(epno);
  *rxaddr = addr;
#endif
}

/****************************************************************************
 * Name: stm32_seteprxaddr
 ****************************************************************************/

static inline uint16_t stm32_geteprxaddr(uint8_t epno)
{
#ifdef CONFIG_STM32_HAVE_IP_USBDEV_M0_V2
  volatile uint32_t *rxaddr = (uint32_t *)STM32_USB_RX(epno);
#else
  volatile uint16_t *rxaddr = (uint16_t *)STM32_USB_ADDR_RX(epno);
#endif
  return (uint16_t)*rxaddr;
}

/****************************************************************************
 * Name: stm32_setepaddress
 ****************************************************************************/

static inline void stm32_setepaddress(uint8_t epno, uint16_t addr)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

  regval  = stm32_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_EA_MASK;
  regval |= (addr << USB_EPR_EA_SHIFT);
  stm32_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32_seteptype
 ****************************************************************************/

